<details ><summary>apply for staging 2025-04-03 07:57:49 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kahnwong/digger-demo#staging has been locked by PR #4
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 40
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_string = (known after apply)
random_string.random: Creating...
random_string.random: Creation complete after 0s [id=gBGEY3NwSZXLVpf7A8wkR1KdZrI7ixrEjoZGmdpb]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

random_string = "gBGEY3NwSZXLVpf7A8wkR1KdZrI7ixrEjoZGmdpb"

```
</details>

</details>